app/controllers/annotations_controller.rb

SELECT * FROM "annotations"
---
  def index
    @annotations = Annotation.all

SELECT * FROM "annotations" WHERE ("annotations"."id" = 2)
---
  def show
    @annotation = Annotation.find(params[:id])

SELECT * FROM "annotations" WHERE ("annotations"."id" = 1)
---
  def edit
    @annotation = Annotation.find(params[:id])

INSERT INTO "annotations" ("name", "norm_id", "updated_at", "document_id", "line", "lemma_id", "partofspeech_id", "position", "created_at") VALUES('Tester', NULL, '2011-01-29 13:26:18', 1, NULL, 1, NULL, NULL, '2011-01-29 13:26:18')
---
  def create
    @annotation = Annotation.new(params[:annotation])
    #@annotation.lemma_id =1
    #@annotation.partofspeech_id=1
    #@annotation.norm_id=1

    respond_to do |format|
      if @annotation.save

SELECT * FROM "annotations" WHERE ("annotations"."id" = 1)
DELETE FROM "annotations" WHERE "id" = 1
---
  def destroy
    @annotation = Annotation.find(params[:id])
    @annotation.destroy