app/controllers/documents_controller.rb

  def index
    @documents = Document.all
---
SELECT * FROM "documents"

  def show
    @document = Document.find(params[:id])
---
SELECT * FROM "documents" WHERE ("documents"."id" = 1)

  def edit
    @document = Document.find(params[:id])
---
SELECT * FROM "documents" WHERE ("documents"."id" = 1)

def create
    #@document = Document.new(params[:document])

    file_param = params[:create][:file]
    name = params[:create][:name]
    filedata = file_param.read

    @document = Document.create(:name => name)
---
INSERT INTO "documents" ("name", "updated_at", "created_at") VALUES('tester', '2011-01-24 21:12:14', '2011-01-24 21:12:14')

def post
  @document = Document.find(params[:id])
  @document.attributes = params[:document]
  @document.annotations.each {|a| t.attributes = params[:annotation][a.id.to_s]}

  @document.annotations.token.each { |t| t.attributes = params[:token][t.id.to_s] }
  if @document.valid? && @document.annotations.all?(&:valid?)
    @document.save!
---
SELECT * FROM "documents" WHERE ("documents"."id" = 1)
SELECT * FROM "annotations" WHERE ("annotations".document_id = 1)
UPDATE "annotations" SET "name" = 'test A', "updated_at" = '2011-01-24 21:41:37' WHERE "id" = 1
UPDATE "documents" SET "name" = 'test D', "updated_at" = '2011-01-24 21:41:37' WHERE "id" = 1

def update

  @document = Document.find(params[:id])

    @document.update_attributes(params[:document]) ?
---
SELECT * FROM "documents" WHERE ("documents"."id" = 1)
UPDATE "documents" SET "name" = 'Doc Test', "updated_at" = '2011-01-25 22:16:43' WHERE "id" = 1

  def destroy
    @document = Document.find(params[:id])
    @document.destroy
---
SELECT * FROM "documents" WHERE ("documents"."id" = 1)
DELETE FROM "documents" WHERE "id" = 1