app/controllers/lemmas_controller.rb

  def index
    @lemmas = Lemma.all
---
SELECT * FROM "lemmas"

  def show
    @lemma = Lemma.find(params[:id])
---
SELECT * FROM "lemmas" WHERE ("lemmas"."id" = 1)

  def edit
    @lemma = Lemma.find(params[:id])
---
SELECT * FROM "lemmas" WHERE ("lemmas"."id" = 1)

  def create
    @lemma = Lemma.new(params[:lemma])

    respond_to do |format|
      if @lemma.save
---
INSERT INTO "lemmas" ("updated_at", "lemma", "created_at") VALUES('2011-01-27 23:40:56', 'Test Lemma', '2011-01-27 23:40:56')

  def destroy
    @lemma = Lemma.find(params[:id])
    @lemma.destroy
---
SELECT * FROM "lemmas" WHERE ("lemmas"."id" = 18)
DELETE FROM "lemmas" WHERE "id" = 18