app/controllers/norms_controller.rb

SELECT * FROM "norms"
---
  def index
    @norms = Norm.all

SELECT * FROM "norms" WHERE ("norms"."id" = 1)
---
  def show
    @norm = Norm.find(params[:id])

INSERT INTO "norms" ("updated_at", "norm", "created_at") VALUES('2011-01-30 14:32:57', 'test', '2011-01-30 14:32:57')
---
  def create
    @norm = Norm.new(params[:norm])

    respond_to do |format|
      if @norm.save