app/controllers/partofspeeches_controller.rb

  def index
    @partofspeeches = Partofspeech.all
---
SELECT * FROM "partofspeeches"

  def show
    @partofspeech = Partofspeech.find(params[:id])
---
SELECT * FROM "partofspeeches" WHERE ("partofspeeches"."id" = 1)

  def edit
    @partofspeech = Partofspeech.find(params[:id])
---
SELECT * FROM "partofspeeches" WHERE ("partofspeeches"."id" = 2)

  def create
    @partofspeech = Partofspeech.new(params[:partofspeech])

    respond_to do |format|
      if @partofspeech.save
---
INSERT INTO "partofspeeches" ("updated_at", "partofspeech", "created_at") VALUES('2011-01-29 14:18:53', 'Tester', '2011-01-29 14:18:53')