app/controllers/tokens_controller.rb

SELECT * FROM "tokens"
---
  def index
    @tokens = Token.all

SELECT * FROM "tokens" WHERE ("tokens"."id" = 1)
---
  def show
    @token = Token.find(params[:id])

SELECT * FROM "tokens" WHERE ("tokens"."id" = 1)
---
  def edit
    @token = Token.find(params[:id])

INSERT INTO "tokens" ("annotation_id", "updated_at", "token", "created_at") VALUES(1, '2011-01-25 21:15:35', 'boo', '2011-01-25 21:15:35')
---
  def create
    @token = Token.new(params[:token])

    respond_to do |format|
      if @token.save

SELECT * FROM "tokens" WHERE ("tokens"."id" = 1)
UPDATE "tokens" SET "annotation_id" = 2, "updated_at" = '2011-01-29 13:26:28' WHERE "id" = 1
---
  def update
    @token = Token.find(params[:id])

    respond_to do |format|
      if @token.update_attributes(params[:token])

SELECT * FROM "tokens" WHERE ("tokens"."id" = 2)
DELETE FROM "tokens" WHERE "id" = 2
---
  def destroy
    @token = Token.find(params[:id])
    @token.destroy